In [8]:
import pandas as pd
import numpy as np

In [9]:
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [10]:
df

          W         X         Y         Z
A  0.756488 -0.004171 -1.324667  1.157933
B  0.340060  0.369122 -0.299344 -0.757167
C -0.890511  0.971282  1.297824  0.250215
D  0.553003  1.020390 -0.179360 -1.862723
E  2.007304  0.170090  0.314168 -0.364649

In [11]:
df ['W']

A    0.756488
B    0.340060
C   -0.890511
D    0.553003
E    2.007304
Name: W, dtype: float64

In [12]:
df.W

A    0.756488
B    0.340060
C   -0.890511
D    0.553003
E    2.007304
Name: W, dtype: float64

In [13]:
df[['W','Z','Y']]

          W         Z         Y
A  0.756488  1.157933 -1.324667
B  0.340060 -0.757167 -0.299344
C -0.890511  0.250215  1.297824
D  0.553003 -1.862723 -0.179360
E  2.007304 -0.364649  0.314168

In [14]:
df['baru'] = df['W'] + df['Y']

In [15]:
df

          W         X         Y         Z      baru
A  0.756488 -0.004171 -1.324667  1.157933 -0.568179
B  0.340060  0.369122 -0.299344 -0.757167  0.040716
C -0.890511  0.971282  1.297824  0.250215  0.407313
D  0.553003  1.020390 -0.179360 -1.862723  0.373643
E  2.007304  0.170090  0.314168 -0.364649  2.321471

In [16]:
df.drop('baru',axis=1) #axis = 0 adalah index dan 1 adalah kolom

          W         X         Y         Z
A  0.756488 -0.004171 -1.324667  1.157933
B  0.340060  0.369122 -0.299344 -0.757167
C -0.890511  0.971282  1.297824  0.250215
D  0.553003  1.020390 -0.179360 -1.862723
E  2.007304  0.170090  0.314168 -0.364649

In [17]:
df

          W         X         Y         Z      baru
A  0.756488 -0.004171 -1.324667  1.157933 -0.568179
B  0.340060  0.369122 -0.299344 -0.757167  0.040716
C -0.890511  0.971282  1.297824  0.250215  0.407313
D  0.553003  1.020390 -0.179360 -1.862723  0.373643
E  2.007304  0.170090  0.314168 -0.364649  2.321471

In [18]:
df.drop('baru',axis=1,inplace=True)

In [19]:
df

          W         X         Y         Z
A  0.756488 -0.004171 -1.324667  1.157933
B  0.340060  0.369122 -0.299344 -0.757167
C -0.890511  0.971282  1.297824  0.250215
D  0.553003  1.020390 -0.179360 -1.862723
E  2.007304  0.170090  0.314168 -0.364649

In [20]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.756488 -0.004171 -1.324667  1.157933
B  0.340060  0.369122 -0.299344 -0.757167
C -0.890511  0.971282  1.297824  0.250215
D  0.553003  1.020390 -0.179360 -1.862723

In [21]:
df.loc['A']

W    0.756488
X   -0.004171
Y   -1.324667
Z    1.157933
Name: A, dtype: float64

In [22]:
df.iloc[2]

W   -0.890511
X    0.971282
Y    1.297824
Z    0.250215
Name: C, dtype: float64

In [23]:
df.loc['C','Z']

0.2502147195843521

In [24]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.756488 -1.324667
B  0.340060 -0.299344

In [25]:
df > 0

       W      X      Y      Z
A   True  False  False   True
B   True   True  False  False
C  False   True   True   True
D   True   True  False  False
E   True   True   True  False

In [26]:
df[df > 0]

          W         X         Y         Z
A  0.756488       NaN       NaN  1.157933
B  0.340060  0.369122       NaN       NaN
C       NaN  0.971282  1.297824  0.250215
D  0.553003  1.020390       NaN       NaN
E  2.007304  0.170090  0.314168       NaN

In [27]:
df[df['W']>0]

          W         X         Y         Z
A  0.756488 -0.004171 -1.324667  1.157933
B  0.340060  0.369122 -0.299344 -0.757167
D  0.553003  1.020390 -0.179360 -1.862723
E  2.007304  0.170090  0.314168 -0.364649

In [28]:
df[df['W']>0]['Y']

A   -1.324667
B   -0.299344
D   -0.179360
E    0.314168
Name: Y, dtype: float64

In [29]:
df[df['W']>0][['Y','Z']]

          Y         Z
A -1.324667  1.157933
B -0.299344 -0.757167
D -0.179360 -1.862723
E  0.314168 -0.364649

In [30]:
df[(df['W']>0) & (df['X']>1)]

          W        X        Y         Z
D  0.553003  1.02039 -0.17936 -1.862723

In [31]:
df[(df['W']>0) | (df['X']>1)]

          W         X         Y         Z
A  0.756488 -0.004171 -1.324667  1.157933
B  0.340060  0.369122 -0.299344 -0.757167
D  0.553003  1.020390 -0.179360 -1.862723
E  2.007304  0.170090  0.314168 -0.364649

In [32]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.756488 -0.004171 -1.324667  1.157933
1     B  0.340060  0.369122 -0.299344 -0.757167
2     C -0.890511  0.971282  1.297824  0.250215
3     D  0.553003  1.020390 -0.179360 -1.862723
4     E  2.007304  0.170090  0.314168 -0.364649

In [34]:
df['kode'] = "INA IND JPN RSA USA".split()

In [35]:
df

          W         X         Y         Z kode
A  0.756488 -0.004171 -1.324667  1.157933  INA
B  0.340060  0.369122 -0.299344 -0.757167  IND
C -0.890511  0.971282  1.297824  0.250215  JPN
D  0.553003  1.020390 -0.179360 -1.862723  RSA
E  2.007304  0.170090  0.314168 -0.364649  USA

In [36]:
df.set_index('kode')

             W         X         Y         Z
kode
INA   0.756488 -0.004171 -1.324667  1.157933
IND   0.340060  0.369122 -0.299344 -0.757167
JPN  -0.890511  0.971282  1.297824  0.250215
RSA   0.553003  1.020390 -0.179360 -1.862723
USA   2.007304  0.170090  0.314168 -0.364649

In [37]:
df

          W         X         Y         Z kode
A  0.756488 -0.004171 -1.324667  1.157933  INA
B  0.340060  0.369122 -0.299344 -0.757167  IND
C -0.890511  0.971282  1.297824  0.250215  JPN
D  0.553003  1.020390 -0.179360 -1.862723  RSA
E  2.007304  0.170090  0.314168 -0.364649  USA

In [38]:
df.set_index('kode', inplace=True)

In [39]:
df

             W         X         Y         Z
kode
INA   0.756488 -0.004171 -1.324667  1.157933
IND   0.340060  0.369122 -0.299344 -0.757167
JPN  -0.890511  0.971282  1.297824  0.250215
RSA   0.553003  1.020390 -0.179360 -1.862723
USA   2.007304  0.170090  0.314168 -0.364649

In [40]:
dataLabels = ['G1','G1','G1','G2','G2','G2']
dataValue = [1,2,3,1,2,3]
data = list(zip(dataLabels,dataValue))

data = pd.MultiIndex.from_tuples(data)

In [41]:
zip(dataLabels,dataValue)

In [42]:
list(zip(dataLabels,dataValue))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [44]:
data

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [45]:
df = pd.DataFrame(np.random.randn(6,2),index=data,columns=['A','B'])

In [46]:
df

             A         B
G1 1  0.753120 -0.461587
   2 -0.022824  1.338511
   3 -0.098886 -1.778655
G2 1 -1.040394 -1.388292
   2  1.732012 -1.101388
   3 -0.888907 -0.473897

In [47]:
df.loc['G1']

          A         B
1  0.753120 -0.461587
2 -0.022824  1.338511
3 -0.098886 -1.778655

In [48]:
df.loc['G1'].loc[3]

A   -0.098886
B   -1.778655
Name: 3, dtype: float64

In [49]:
df.index.names

FrozenList([None, None])

In [52]:
df.index.names = ['Grup','Nomor']

In [53]:
df

                   A         B
Grup Nomor
G1   1      0.753120 -0.461587
     2     -0.022824  1.338511
     3     -0.098886 -1.778655
G2   1     -1.040394 -1.388292
     2      1.732012 -1.101388
     3     -0.888907 -0.473897

In [54]:
df.xs('G1')

              A         B
Nomor
1      0.753120 -0.461587
2     -0.022824  1.338511
3     -0.098886 -1.778655

In [55]:
df.xs(['G2',2])

A    1.732012
B   -1.101388
Name: (G2, 2), dtype: float64

In [56]:
df.xs(1,level='Nomor')

             A         B
Grup
G1    0.753120 -0.461587
G2   -1.040394 -1.388292